In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
csv_file = "twtr_clean_all.csv"
twtr_all = pd.read_csv(csv_file)
twtr_all.head()

,Date,Open,High,Low,Close,Volume,Dividends,Stock Splits
0,2013-11-07,45.099998,50.090000,44.000000,44.900002,117701670,0.0,0.0
1,2013-11-08,45.930000,46.939999,40.685001,41.650002,27925307,0.0,0.0
2,2013-11-11,40.500000,43.000000,39.400002,42.900002,16113941,0.0,0.0
3,2013-11-12,43.660000,43.779999,41.830002,41.900002,6316755,0.0,0.0
4,2013-11-13,41.029999,42.869999,40.759998,42.599998,8688325,0.0,0.0

In [3]:
twtr_all_df = twtr_all[['Date', 'Open', 'High','Low','Close','Volume']].copy()
twtr_all_df.head()

          Date       Open       High        Low      Close     Volume
0  2013-11-07   45.099998  50.090000  44.000000  44.900002  117701670
1  2013-11-08   45.930000  46.939999  40.685001  41.650002   27925307
2  2013-11-11   40.500000  43.000000  39.400002  42.900002   16113941
3  2013-11-12   43.660000  43.779999  41.830002  41.900002    6316755
4  2013-11-13   41.029999  42.869999  40.759998  42.599998    8688325

In [4]:
json_file = "twtr_dates.json"
twtr_dates_df = pd.read_json(json_file)
twtr_dates_df.head()

        Date                                           Headline
0 2022-01-31      January 31: Musk begins building up his Tw...
1 2022-03-14            March 14: Musk’s Twitter stake tops 5%
2 2022-03-24      March 24: Asking whether Twitter should ch...
5 2022-04-04      April 4: Surprise! Musk becomes Twitter’s ...
6 2022-04-05             April 5: Musk agrees to join the board

In [5]:
import psycopg2

In [6]:
protocol = 'postgresql'
username = 'postgres'
password = 'postgres'
host = 'localhost'
port = 5432
database_name = 'twitter_db'
rds_connection_string = f'{protocol}://{username}:{password}@{host}:{port}/{database_name}'
engine = create_engine(rds_connection_string)

In [7]:
engine.table_names()

['twtr_all', 'twtr_dates']

In [8]:
twtr_all_df.to_sql(name='twtr_all', con=engine, if_exists='append', index=False)

IntegrityError: (psycopg2.errors.UniqueViolation) duplicate key value violates unique constraint "pk_twtr_all"
DETAIL:  Key ("Date")=(2013-11-07) already exists.

[SQL: INSERT INTO twtr_all ("Date", "Open", "High", "Low", "Close", "Volume") VALUES (%(Date)s, %(Open)s, %(High)s, %(Low)s, %(Close)s, %(Volume)s)]
[parameters: ({'Date': '2013-11-07 ', 'Open': 45.099998474121094, 'High': 50.09000015258789, 'Low': 44.0, 'Close': 44.900001525878906, 'Volume': 117701670}, {'Date': '2013-11-08 ', 'Open': 45.93000030517578, 'High': 46.93999862670898, 'Low': 40.685001373291016, 'Close': 41.650001525878906, 'Volume': 27925307}, {'Date': '2013-11-11 ', 'Open': 40.5, 'High': 43.0, 'Low': 39.400001525878906, 'Close': 42.900001525878906, 'Volume': 16113941}, {'Date': '2013-11-12 ', 'Open': 43.65999984741211, 'High': 43.77999877929688, 'Low': 41.83000183105469, 'Close': 41.900001525878906, 'Volume': 6316755}, {'Date': '2013-11-13 ', 'Open': 41.02999877929688, 'High': 42.86999893188477, 'Low': 40.7599983215332, 'Close': 42.599998474121094, 'Volume': 8688325}, {'Date': '2013-11-14 ', 'Open': 42.34000015258789, 'High': 45.66999816894531, 'Low': 42.2400016784668, 'Close': 44.68999862670898, 'Volume': 11099433}, {'Date': '2013-11-15 ', 'Open': 45.25, 'High': 45.27000045776367, 'Low': 43.43000030517578, 'Close': 43.97999954223633, 'Volume': 8010663}, {'Date': '2013-11-18 ', 'Open': 43.5, 'High': 43.95000076293945, 'Low': 40.849998474121094, 'Close': 41.13999938964844, 'Volume': 12810624}  ... displaying 10 of 2259 total bound parameter sets ...  {'Date': '2022-10-26 ', 'Open': 52.95000076293945, 'High': 53.5, 'Low': 52.77000045776367, 'Close': 53.349998474121094, 'Volume': 28064973}, {'Date': '2022-10-27 ', 'Open': 53.90999984741211, 'High': 54.0, 'Low': 53.70000076293945, 'Close': 53.70000076293945, 'Volume': 136345128})]
(Background on this error at: http://sqlalche.me/e/gkpj)

In [18]:
twtr_dates_df.to_sql(name='twtr_dates', con=engine, if_exists='append', index=False)

In [9]:
pd.read_sql_query('select * from twtr_all', con=engine).head()

         Date  Open  High   Low  Close     Volume
0  2013-11-07  45.0  50.0  44.0   45.0  117701670
1  2013-11-08  46.0  47.0  41.0   42.0   27925307
2  2013-11-11  41.0  43.0  39.0   43.0   16113941
3  2013-11-12  44.0  44.0  42.0   42.0    6316755
4  2013-11-13  41.0  43.0  41.0   43.0    8688325

In [10]:
pd.read_sql_query('select * from twtr_dates', con=engine).head()

         Date                                           Headline
0  2022-01-31      January 31: Musk begins building up his Tw...
1  2022-03-14            March 14: Musk’s Twitter stake tops 5%
2  2022-03-24      March 24: Asking whether Twitter should ch...
3  2022-04-04      April 4: Surprise! Musk becomes Twitter’s ...
4  2022-04-05             April 5: Musk agrees to join the board

In [11]:
sql_join = r"""select twtr_dates."Headline",
	twtr_all."Open",
	twtr_all."High",
	twtr_all."Low",
	twtr_all."Close"
from "twtr_dates"
join "twtr_all"
on twtr_all."Date" = twtr_dates."Date" """

In [12]:
pd.read_sql_query(sql_join, con=engine)

                                             Headline  Open  High   Low  Close
0       January 31: Musk begins building up his Tw...  35.0  38.0  35.0   38.0
1             March 14: Musk’s Twitter stake tops 5%   33.0  34.0  32.0   33.0
2       March 24: Asking whether Twitter should ch...  38.0  39.0  38.0   39.0
3       April 4: Surprise! Musk becomes Twitter’s ...  48.0  51.0  47.0   50.0
4              April 5: Musk agrees to join the board  54.0  55.0  51.0   51.0
5       April 14: Musk offers to buy Twitter and ‘...  48.0  49.0  45.0   45.0
6       April 21: Musk lines up $46.5 billion in f...  46.0  48.0  46.0   47.0
7       April 25: Twitter agrees to sell itself to...  51.0  52.0  50.0   52.0
8       April 29: Musk cashes out billions in Tesl...  49.0  50.0  49.0   49.0
9       May 4: With a little help from his billion...  49.0  49.0  48.0   49.0
10      May 6: Musk’s lofty goals for Twitter, rev...  50.0  50.0  50.0   50.0
11      May 10: Musk says he would reinstate Trump...  48.0  48.0  47.0   47.0
12      May 12: A partial hiring freeze and execut...  45.0  47.0  43.0   45.0
13         May 13: Twitter deal ‘temporarily on hold’  40.0  42.0  40.0   41.0
14                                 May 16: Poop emoji  39.0  39.0  37.0   37.0
15      May 17: Musk says Twitter deal ‘cannot mov...  37.0  39.0  37.0   38.0
16                      June 6: A threat to walk away  38.0  40.0  38.0   40.0
17               July 8: Actually trying to walk away  38.0  38.0  37.0   37.0
18                         July 12: Twitter sues Musk  33.0  34.0  33.0   34.0
19                             July 29: Save the date  41.0  42.0  41.0   42.0
20      September 13: Whistleblower testifies befo...  41.0  42.0  40.0   42.0
21      October 3: Musk wants Twitter at the full ...  44.0  44.0  42.0   43.0
22         October 6: The clock is officially ticking  51.0  52.0  49.0   49.0
23                 October 27: Elon now owns Twitter   54.0  54.0  54.0   54.0

In [ ]:
# select * from twtr_dates;

# select twtr_dates.Date, twtr_all.Volume
# from twtr_dates
# inner join twtr_all
# on twtr_all.Date = twtr_dates.Date;

# select "Headline"
# from "twtr_dates"
# where "Date" = '2022-04-05';

# select twtr_dates."Date",
# 	twtr_dates."Headline",
# 	twtr_all."Open",
# 	twtr_all."High",
# 	twtr_all."Low",
# 	twtr_all."Close"
# from "twtr_dates"
# join "twtr_all"
# on twtr_all."Date" = twtr_dates."Date";

# select twtr_dates."Headline",
# 	twtr_all."Open",
# 	twtr_all."High",
# 	twtr_all."Low",
# 	twtr_all."Close"
# from "twtr_dates"
# join "twtr_all"
# on twtr_all."Date" = twtr_dates."Date";